from django.shortcuts import render


# TODO: 

"""
ساختار برای اکانت پزشکان باید به این صورت باشه که ابتدا کاربر در صفحه ی ثبت نام اگر به عنوان دکتر ثبت نام کرد:
1-یک پروفایل دکتر ایجاد خواهد شد اما:

1-1(هیچ قابلیتی ندارد، یعنی هیچ چیزی نمیتواند اضافه ،تغییر یا حذف کند)
1-2(به مدت 12 ساعت فرصت دارد تا شماره نظام پزشکی خود را وارد کند)
1-2-1(ابتدا اگر شماره نظام پزشکی خود را در مدت 7 ساعت بعد از ثبت نام وارد نکند،یک پیامک هشدار برای او ارسال خواهد شد،اگر تا 6 ساعت بعد از ارسال پیامک شماره نظام پزشکی خود را تایید نکند،حساب ش غیرفعال میشود و این عمل با پیامک به او ابلاغ می شود)
1-2-2(در دفعه ی دوم:همین روند تکرار خواهد شد اما اگر اینبار شماره نظام پزشکی خود را وارد نکند،حساب ش برای همیشه بسته خواهد شد و دیگر امکان ثبت نام در این سایت را نخواهد داشت.)

2-اگر کاربری که به عنوان دکتر ثبت نام کرده است و یک شماره ی نظام پزشکی وارد کرده است باید از صحت آن شماره اطمینان پیدا کرد

"""
